Repository: sdanielf/dictate
Catalog: doc/gettext/*.po
Languages: es

source: Dictate's documentation
es: Documentación de Dictate

source: Command-line usage
es: Uso en la linea de comandos

source: The text to speak is given as an argument.
es: El texto para hablar se proporciona como un argumento.

source: See an example::
es: Ver un ejemplo::

source: If you want to load the text from a file, you can use the file path as the argument::
es: Si quiere cargar el texto desde un archivo, puede usar la ruta del archivo como argumento::

source: The language can be set through adding the argument ``-l``::
es: El lenguaje se puede configurar añadiendo el argumento ``-l``::

source: To see the list of available voices, type ``espeak --voices``.
es: Para ver la lista de voces disponibles, escriba ``espeak --voices``.

source: The speed of espeak can be controlled with the argument ``-s`` and the time between words (TBW) can be controlled with the argument ``-t``::
es: La velocidad de espeak puede controlarse con el argumento ``-s`` y el tiempo entre palabras (TBW) con el argumento ``-t``::

source: With ``-e``, some arguments can be given directly to the espeak command, in the following example the amplitude is set::
es: Con ``-e``, algunos argumentos se le pueden proporcionar directamente al comando espeak, en el siguiente ejemplo, se regula el volumen::

source: See `eSpeak Usage <http://espeak.sourceforge.net/commands.html>`_.
es: Ver `Uso de eSpeak <http://espeak.sourceforge.net/commands.html>`_.

source: A short help message can be shown by typing::
es: Se puede mostrar un mensaje corto de ayuda escribiendo::

source: Configuring default behavior
es: Configurando el comportamiento predeterminado

source: Dictate reads the default preferences from the file ``~/.dictate``. All those settings can be overwritten with command-line arguments.
es: Dictate lee las preferencias por defecto del archivo ``~/.dictate``. Todas estas configuraciones se pueden sobrescribir con los argumentos de la linea de comandos.

source: If you want to set Dictate's language to Spanish by default, you can modify the language line::
es: Si quiere configurar el idioma predeterminado de Dictate a español, puede modificar la linea del idioma::

source: Runtime options
es: Opciones de ejecución

source: Once the program is running, some keys can be used to control the dictation. The keys are displayed when the program starts. The most important are:
es: Una vez que el programa está funcionando, pueden usarse algunas teclas para controlar el dictado. Las teclas se muestran cuando el programa inicia. Las más importantes son:

source: ``q`` to stop the dictation.
es: ``q`` para detener el dictado.

source: ``spacebar`` to pause the dictation until the ``spacebar`` is pressed again.
es: ``barra espaciadora`` para pausar el dictado hasta que se presione la ``barra espaciadora`` nuevamente.

source: ``s`` to spell the current word.
es: ``s`` para deletrear la palabra actual.
